Infineon/Code-Examples-for-the-ModusToolbox-PSoC-6-SDK/CE223468_Interfacing_BMI160_FreeRTOS/Source/main.c
/******************************************************************************
* File Name: main.c
*
* Version 1.0
*
* Description: This code example demonstrates how to interface PSoC® 6 MCU with
*  a BMI160 Motion Sensor over an I2C interface within a FreeRTOS task. This
*  example reads raw motion data and estimates the orientation of the board.
*
* Related Document: CE223468_Interfacing_BMI160_FreeRTOS.pdf
*
* Hardware Dependency: See CE223468_Interfacing_BMI160_FreeRTOS.pdf
*
*******************************************************************************
* Copyright (2019), Cypress Semiconductor Corporation. All rights reserved.
*******************************************************************************
* This software, including source code, documentation and related materials
* (“Software”), is owned by Cypress Semiconductor Corporation or one of its
* subsidiaries (“Cypress”) and is protected by and subject to worldwide patent
* protection (United States and foreign), United States copyright laws and
* international treaty provisions. Therefore, you may use this Software only
* as provided in the license agreement accompanying the software package from
* which you obtained this Software (“EULA”).
*
* If no EULA applies, Cypress hereby grants you a personal, nonexclusive,
* non-transferable license to copy, modify, and compile the Software source
* code solely for use in connection with Cypress’s integrated circuit products.
* Any reproduction, modification, translation, compilation, or representation
* of this Software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death (“High Risk Product”). By
* including Cypress’s product in a High Risk Product, the manufacturer of such
* system or application assumes all risk of such use and in doing so agrees to
* indemnify Cypress against all liability.
*******************************************************************************/

/* Header files */
#include "cycfg.h"
#include "cy_sysint.h"
#include "cy_syspm.h"
#include <stdio.h>
#include "stdio_user.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"
#include "motion_task.h"
#include "uart_debug.h"

/** Priority of user tasks in this application. Valid range of task priory is priority
 * is 0 to ( configMAX_PRIORITIES - 1 ), where configMAX_PRIORITIES is defined within
 * FreeRTOSConfig.h. Low priority numbers denote low priority tasks. */
#define TASK_MOTION_SENSOR_PRIORITY 	(configMAX_PRIORITIES - 1)

/* Stack size of user tasks in this project */
#define TASK_MOTION_SENSOR_STACK_SIZE	(256u)

/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
*  System entrance point. This function sets up user tasks and then starts
*  the RTOS scheduler.
*  In this application there are two tasks:
*  1. Task_Motion : configures and processes the Motion Sensor
*  2. Task_Debug  : prints debug message via UART STDIO
*
* Parameters:
*  void
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    /* Set up internal routing, pins, and clock-to-peripheral connections */
    init_cycfg_all();
    
    /* Start UART */
    DebugPrintfInit();

    /* \x1b[2J\x1b[;H - ANSI ESC sequence to clear screen */
    printf("\x1b[2J\x1b[;H");
    printf("CE223468 - PSoC 6 MCU: Interfacing BMI160 (I2C) in FreeRTOS\r\n");

	/* Create the user Tasks. See the respective Task definition for more
	 * details of these tasks */
    xTaskCreate(Task_Motion, "Motion Sensor Task", TASK_MOTION_SENSOR_STACK_SIZE,
    		NULL, TASK_MOTION_SENSOR_PRIORITY, &xTaskHandleMotion);

    /* Create a task to do thread-safe debug message printing */
    InitDebugPrintf();

    /* Start scheduler */
    vTaskStartScheduler();

    /* Should never get here! */
    /* Halt the CPU if scheduler exits */
	 CY_ASSERT(0);

    for(;;)
    {
    }
}

/*******************************************************************************
* Function Name: void vApplicationIdleHook(void)
********************************************************************************
*
* Summary:
*  This function is called when the RTOS in idle mode
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void vApplicationIdleHook(void)
{
    /* Enter sleep-mode */
    Cy_SysPm_Sleep(CY_SYSPM_WAIT_FOR_INTERRUPT);
}

/*******************************************************************************
* Function Name: void vApplicationStackOverflowHook(TaskHandle_t *pxTask,
                                                    signed char *pcTaskName)
********************************************************************************
*
* Summary:
*  This function is called when a stack overflow has been detected by the RTOS
*
* Parameters:
*  TaskHandle_t  : Handle to the task
*  signed char   : Name of the task
*
* Return:
*  None
*
*******************************************************************************/
void vApplicationStackOverflowHook(TaskHandle_t *pxTask, signed char *pcTaskName)
{
    /* Remove warning for unused parameters */
    (void)pxTask;

    /* Print the error message with task name if debug is enabled in
       uart_debug.h file */
    printf("Error!   : RTOS - stack overflow in %s \r\n", pcTaskName);

    /* Halt the CPU */
    CY_ASSERT(0);
}

/*******************************************************************************
* Function Name: void vApplicationMallocFailedHook(void)
********************************************************************************
*
* Summary:
*  This function is called when a memory allocation operation by the RTOS
*  has failed
*
* Parameters:
*  None
*
* Return:
*  None
*
*******************************************************************************/
void vApplicationMallocFailedHook(void)
{
    /* Print the error message if debug is enabled in uart_debug.h file */
    printf("Error!   : RTOS - Memory allocation failed \r\n");

    /* Halt the CPU */
    CY_ASSERT(0);
}

/* [] END OF FILE */
